## Production: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                     |
|--------|------------------------------------------------------------------------------|
| add    | `aws_docdb_cluster.ai-answers-docdb-cluster`                                 |
|        | `aws_docdb_cluster_instance.ai-answers-docdb-instance[0]`                    |
|        | `aws_docdb_cluster_parameter_group.ai-answers-docdb-cluster-parameter-group` |
|        | `aws_docdb_subnet_group.ai-answers-docdb-subnet-group`                       |
|        | `aws_security_group.ai-answers-docdb-sg`                                     |
|        | `aws_ssm_parameter.docdb_uri`                                                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_docdb_cluster.ai-answers-docdb-cluster will be created
  + resource "aws_docdb_cluster" "ai-answers-docdb-cluster" {
      + apply_immediately               = true
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backup_retention_period         = 1
      + cluster_identifier              = "ai-answers-docdb-cluster"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + db_cluster_parameter_group_name = "ai-answers-docdb-cluster-parameter-group"
      + db_subnet_group_name            = "ai-answers-example-docdb-subnet-group"
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = "5.0.0"
      + hosted_zone_id                  = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_username                 = (sensitive value)
      + port                            = 27017
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = true
      + storage_encrypted               = true
      + tags                            = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + vpc_security_group_ids          = (known after apply)
    }

  # aws_docdb_cluster_instance.ai-answers-docdb-instance[0] will be created
  + resource "aws_docdb_cluster_instance" "ai-answers-docdb-instance" {
      + apply_immediately               = true
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = (known after apply)
      + cluster_identifier              = (known after apply)
      + db_subnet_group_name            = (known after apply)
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + id                              = (known after apply)
      + identifier                      = "ai-answers-docdb-instance"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.t3.medium"
      + kms_key_id                      = (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + promotion_tier                  = 0
      + publicly_accessible             = (known after apply)
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + writer                          = (known after apply)
    }

  # aws_docdb_cluster_parameter_group.ai-answers-docdb-cluster-parameter-group will be created
  + resource "aws_docdb_cluster_parameter_group" "ai-answers-docdb-cluster-parameter-group" {
      + arn         = (known after apply)
      + description = "Parameter group for ai-answers production DocumentDB"
      + family      = "docdb5.0"
      + id          = (known after apply)
      + name        = "ai-answers-docdb-cluster-parameter-group"
      + name_prefix = (known after apply)
      + tags        = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }

      + parameter {
          + apply_method = "pending-reboot"
          + name         = "tls"
          + value        = "enabled"
        }
    }

  # aws_docdb_subnet_group.ai-answers-docdb-subnet-group will be created
  + resource "aws_docdb_subnet_group" "ai-answers-docdb-subnet-group" {
      + arn         = (known after apply)
      + description = "Subnet group for DocumentDB for the ai-answers production app"
      + id          = (known after apply)
      + name        = "ai-answers-example-docdb-subnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-03c051206642ed328",
          + "subnet-0f172291e07a56e1d",
        ]
      + tags        = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
    }

  # aws_security_group.ai-answers-docdb-sg will be created
  + resource "aws_security_group" "ai-answers-docdb-sg" {
      + arn                    = (known after apply)
      + description            = "Security group for DocumentDB for the AI Answers app"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "ai-answers-example-docdb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-006a4fac589012225"
    }

  # aws_ssm_parameter.docdb_uri will be created
  + resource "aws_ssm_parameter" "docdb_uri" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "docdb_uri"
      + tags_all       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_docdb_cluster_arn       = (known after apply)
  + aws_docdb_cluster_id        = (known after apply)
  + aws_docdb_security_group_id = (known after apply)
  + docdb_uri_arn               = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.docdb_uri"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
